#1) შექმენით ერთი სია რომელშიც შეიტანთ სახელებს შემდეგ შექმენით მეორე სია რომელშიც იქნება ისევ სხვადასხვა სახელები გააერთიანეთ ეს ორი სია ჩაამატეთ 5 ინდექსზე ახალი სახელი დაითვალეთ გაერთიანებული სიის სიგრძე და დაითვალეთ თქვენი სახელი რამდენჯერ გვხვდება ამ სიაში, ასევე დაბეჭდეთ რომელ ინდექსზე დგას თქვენი სახელი

my_list1 = ["vaso","soso","nika","lika","akuna"]
my_list2 = ["zura","zaza","pavle","petre","giorgi"]

print(my_list1.insert(4,"alex"))
print(my_list1 + my_list2)
print(my_list1.count("giorgi"))