// 1) ახსენით რა არის კომპონენტი React ში და რა უპირატესობა აქვს მას HTML ის ჩვეულებრივ კოდთან შედარებით. რატომ სჯობს კოდის დაყოფა მრავალ კომპონენტებად?


// React-ში კომპონენტი არის დამოუკიდებელი ბლოკი, რომელშიც შეგვიძლია შევინახოთ კონკრეტული კოდი და გამოვიყენოთ საიტის აწყობის დროს ნებისმიერ დროს და ადგილას. მსგავსი არის ფუნქციის. ფუნქციას, რომ შევქმნით შეგვიძლია გამოვიძახოთ ნებისმიერ დროს. 

// საიტის შექმნის დროს ჯობია რომ კოდი კომპონენტებად დავყოთ. ამით კოდი უფრო სუფთა და ორგანიზებული იქნება, მარტივი წასაკითხიც და ნებისმიერ დროს შეიძლება რამდენიმე კომპონენტის გამოყენება.

