# 1) შექმენი ცვლადი my_number და მიაწერე რიცხვი 10, დაბეჭდე ცვლადის მნიშვნელობა.

#2)შექმენი ცვლადი my_text და მიაწერე მას ტექსტი "Hello, World!". დაბეჭდე ცვლადის ტიპი.

#3)შექმენი ორი ცვლადი num1 და num2, და მიაწერე მათ 5 და 15. დაბეჭდე მათ ჯამი.

#4)შექმენი ორი ცვლადი first_name და last_name და მიაწერე მათ შესაბამისი სახელები. დაბეჭდე ორივე ერთად.

#5)შექმენი ცვლადი age და მიაწერე მას 8. შემდეგ შეცვალე მისი მნიშვნელობა 9-ზე და დაბეჭდე ახალი მნიშვნელობა.  

#6) შექმენი ცვლადი, str_num და შეინახეთ “10”, მოცემული ცვლადი გადაიყვანეთ ინტეჯერში და შემდეგ გაამრავლეთ ექვსზე

#7) შექმენი ცვლადები num1 და num2, ამ ცვლადებში შეინახეთ: “10” და “5”, შემდეგ გადაიყვანეთ ინტეჯერებში და გადაამრავლეთ

#8) შექმენით რამოდენიმე ცვლადი მინიმუმ 5 რომლებშიც შეინახავთ რიცხვებს შემდეგ კი დაბეჭდეთ მათი საშუალო არითმეტიკული.

my_number = 10
print(my_number)

my_text = ("Hello World!")
print(type(my_text))

num1 = 5
num2 = 15
print(num1 + num2)

first_name = ("Giorgi ")
last_name = ("Tskhadadze")
print(first_name + last_name)

age = 8
age = 9
print(age)

str_num = "10"
print(int(str_num) * 6)

num1 = "10"
num2 = "5"
print(int("10") * int("5"))

num1 = 3 
num2 = 6
num3 = 9
num4 = 12
num5 = 15

print((num1 + num2 + num3 + num4 + num5) / 5)