// 2) კომენტარებით ახსენით რა არის Rest & Spread ოპერატორები და რა განსხვავებაა მათ შორის
// rest operator გვეხმარება იმაში რომ შევინახოთ რამოდენიმე(სხვა დანარჩენი)მონაცემები ერთ ცვლადში,spread operator გვეხმარება იმაში რომ დავშალოთ სია ან ობიექტი და შევინახოთ სხვა სიაში



// 3) შექმენით ობიექტი მინიმუმ 3 კუთვნილებით(name, age, height). გამოიყენეთ ამ ობიექტზე დესტრუქცია ისე, რომ name კუთვნილება შეინახოს ცვლადში, ხოლო დანარჩენი კუთვნილებებისგან შეიქმნას ახალი ობიექტი(დაგჭირდებათ rest ოპერატორი)

// let me = {
//     name : "goga",
//     surname : "chalauri",
//     age : 20
// }
// let {name , ...other} = me

// console.log(name,other)



// 4) შექმენით 3 ობიექტი, შემდეგ შექმენით ახალი ობიექტი, სადაც ჩააკოპირებთ სამივე მათგანს.(გამოიყენეთ spread ოპერატორი)


// let me = {
//     name: "goga",
//     surname: "chalauri",
//     age: 20
// }

// let me1 = {
//     name1: "goga1",
//     surname1: "chalauri1",
//     age1: 200
// }

// let me2 = {
//     name2: "goga12",
//     surname3: "chalauri12",
//     age3: 2000
// }

// let name = {...me,...me1,...me2 , tel: 555} 
// console.log(name)





// 5) შექმენით ფუნქცია, რომელიც მიიღებს n რაოდენობის სახელს და დაბეჭდავს მათ. შემდეგ შექმენით სახელების სია, დაშალეთ ის და გადაეცით არგუმენტად შექმნილ ფუნქციას.(დაგჭირდებათ reast & spread ოპერატორები)

function n(...names){
    const names1 = ["irakli" , "beqa" , "saba" , "sofia"]
    
    for(let i of names){
        console.log(i)
    }
    
}


n("goga", "giorgi" , "ana" , "gio" , ...names1)